# Δημιουργία της εικόνας της πίστας σε αρχείο gif με βάση τον πίνακα που παράχθηκε στην συνάρτηση gen_matrix().

# Οι μεταβλητές είναι για σκοπούς δοκιμής. Στον κανονικό κώδικα θα παράγονται απο την initialise().
matrix = [[1, 1, 1, 1, 1, 1, 1, 1, 1], [1, 1, 0, 0, 0, 0, 0, 0, 1], [1, 0, 0, 0, 0, 0, 0, 0, 1], [1, 0, 0, 0, 0, 0, 1, 1, 1], [1, 1, 1, 0, 1, 0, 1, 0, 1], [1, 1, 1, 1, 1, 1, 1, 1, 1]]
start_x = 2
start_y = 3
end_x = 3
end_y = 5
dimension_x = 4
dimension_y = 6
# Ο κώδικας για το κυρίως πρόγραμμα αρχίζει από εδώ

#Καθορισμός χρώματος των θέσεων έναρξης/τερματισμού (πράσινο,κόκκινο αντίστοιχα)
matrix[start_x][start_y] = 
matrix[end_x][end_y] = 

for x in matrix:
    for y in matrix[x]:
        