""" 
Η συγκεκριμένη συνάρτηση δημιουργεί ένα πίνακα διαστάσης x*y με βάση τις τιμές που ορίστηκαν από τον χρήστη με την εκτέλεση του προγράμματος και τη συνάρτηση initialise().
Ο πίνακας είναι της μορφής matrix = [[r1,r2,r3], [r1,r2,r3], [r1,r2,r3]] και οι τιμές του σε κάθε σημείο του 
μπορούν να προσπελαστούν με βάση τις συντεταγμένες του με χρήση της έκφρασης matrix[x][y]

* Σημείωση: Τα r1,r2,r3 είναι οι γραμμές(rows) που αντιστοιχούν σε κάθε y
"""

# Οι μεταβλητές είναι για σκοπούς δοκιμής. Στον κανονικό κώδικα θα παράγονται απο την initialise().
dimension_x = 50
dimension_y = 50

def gen_matrix():
    # Δημιουργία κενού πίνακα ο οποίος θα διαμορφωθεί στην τελική μορφή
    matrix = []
    for x in range(dimension_x):
        matrix.append([])
        for y in range(dimension_y):
            matrix[x].append([])
    
    return matrix

print(gen_matrix())